/* eminj-kjcw00-1600-a-t-M4 */
/*********************************************************************/
/*  Copyright Toyota Motor Corporation                               */
/*********************************************************************/

/*********************************************************************/
/* オブジェクト名  |  噴射要求の調停                                 */
/* 注意事項        | フリーポート設定用ファイル                      */
/*-------------------------------------------------------------------*/
/*     個別変更履歴 （個別変更時は以下に変更日、内容を記入すること） */
/*********************************************************************/

#ifndef EMINJ_EDIT_H
#define EMINJ_EDIT_H

/*-------------------------------------------------------------------*/
/* 部品内コンパイルSW                                                */
/*-------------------------------------------------------------------*/
/*+++++++++++++++++++++++++++++++++++++++++++*/
/* HV始動制御要求                            */
/* ON:  【HV始動制御要求使用】               */
/* OFF: 【HV始動制御要求未使用】             */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_STAHV_MEDI        (ON)

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* 1気筒FC制御要求                                      */
/* ON:  【1気筒FC制御要求使用】                         */
/* OFF: 【1気筒FC制御要求未使用】                       */
/* 備考: AES対象機能であるため、AES対象仕向には使用禁止 */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FCFRCTRL_MEDI     (ON)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* 始動時吹け上がり制御要求                  */
/* ON:  【始動時吹け上がり制御要求使用】     */
/* OFF: 【始動時吹け上がり制御要求未使用】   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_STACM_MEDI        (ON)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ｲﾝﾊﾞﾗﾝｽ時の噴射制御要求                   */
/* ON:  【ｲﾝﾊﾞﾗﾝｽ時の噴射制御要求使用】      */
/* OFF: 【ｲﾝﾊﾞﾗﾝｽ時の噴射制御要求未使用】    */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_INJIMB_MEDI       (OFF)

/*++++++++++++++++++++++++++++++++++++++++++++*/
/* OBD要求によるｱｸﾃｨﾌﾞ制御要求                */
/* ON:  【OBD要求によるｱｸﾃｨﾌﾞ制御要求使用】   */
/* OFF: 【OBD要求によるｱｸﾃｨﾌﾞ制御要求未使用】 */
/*++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_ACTOBD_MEDI      (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* ｲﾝﾊﾞﾗﾝｽOBD要求によるｱｸﾃｨﾌﾞ制御要求                */
/* ON:  【ｲﾝﾊﾞﾗﾝｽOBD要求によるｱｸﾃｨﾌﾞ制御要求使用】   */
/* OFF: 【ｲﾝﾊﾞﾗﾝｽOBD要求によるｱｸﾃｨﾌﾞ制御要求未使用】 */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_IMBRQ_MEDI      (ON)

/*++++++++++++++++++++++++++++++++++++++++++++++++*/
/* 失火OBD要求によるｱｸﾃｨﾌﾞ制御要求                */
/* ON:  【失火OBD要求によるｱｸﾃｨﾌﾞ制御要求使用】   */
/* OFF: 【失火OBD要求によるｱｸﾃｨﾌﾞ制御要求未使用】 */
/*++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_MFINJRQ_MEDI       (ON)

/*++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* 燃料系OBD要求によるｱｸﾃｨﾌﾞ制御要求                */
/* ON:  【燃料系OBD要求によるｱｸﾃｨﾌﾞ制御要求使用】   */
/* OFF: 【燃料系OBD要求によるｱｸﾃｨﾌﾞ制御要求未使用】 */
/*++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FKGDRQ_MEDI       (ON)

/*++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* ﾊﾟｰｼｬﾙﾘﾌﾄ学習の為のｱｸﾃｨﾌﾞ制御要求                */
/* ON:  【ﾊﾟｰｼｬﾙﾘﾌﾄ学習の為のｱｸﾃｨﾌﾞ制御要求使用】   */
/* OFF: 【ﾊﾟｰｼｬﾙﾘﾌﾄ学習の為のｱｸﾃｨﾌﾞ制御要求未使用】 */
/*++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_ACTLFG_MEDI       (ON)

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御(触媒暖機時)要求               */
/* ON:  【ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御(触媒暖機時)要求使用】  */
/* OFF: 【ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御(触媒暖機時)要求未使用】*/
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_BINJPLCTR_WC_MEDI       (ON)

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御(HV始動制御時)要求               */
/* ON:  【ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御(HV始動制御時)要求使用】  */
/* OFF: 【ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御(HV始動制御時)要求未使用】*/
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_BINJPLCTR_STAHV_MEDI      (ON)

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御要求                */
/* ON:  【ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御要求使用】   */
/* OFF: 【ﾊﾟｰｼｬﾙﾘﾌﾄ噴射を用いた基本噴射制御要求未使用】 */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_BINJPLCTR_MEDI    (ON)

/*-------------------------------------------------------------------*/
/* フリーポート用コンパイルSW                                        */
/*-------------------------------------------------------------------*/
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/* EMINJ                                                             */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ0切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ0使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ0未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE0             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ1切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ1使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ1未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE1             (OFF)

/* 新構造体要求専用 */
/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ2切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ2使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ2未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE2             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ3切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ3使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ3未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE3             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ4切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ4使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ4未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE4             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ5切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ5使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ5未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE5             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ6切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ6使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ6未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE6             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ7切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ7使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ7未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE7             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ8切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ8使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ8未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE8             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ9切換えSW                          */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ9使用】                     */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ9未使用】                   */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE9             (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ10切換えSW                         */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ10使用】                    */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ10未使用】                  */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE10            (OFF)

/*+++++++++++++++++++++++++++++++++++++++++++*/
/* ﾌﾘｰﾎﾟｰﾄ11切換えSW                         */
/* ON： 【ﾌﾘｰﾎﾟｰﾄ11使用】                    */
/* OFF：【ﾌﾘｰﾎﾟｰﾄ11未使用】                  */
/*+++++++++++++++++++++++++++++++++++++++++++*/
#define EMINJ_FREE11            (OFF)

/*-------------------------------------------------------------------*/
/* ヘッダファイルのインクルード                                      */
/*-------------------------------------------------------------------*/
#if EMINJ_FREE0 == ON       /*【ﾌﾘｰﾎﾟｰﾄ0使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート0使用時にインクルード追加 */
#endif /* EMINJ_FREE0 */

#if EMINJ_FREE1 == ON       /*【ﾌﾘｰﾎﾟｰﾄ1使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート1使用時にインクルード追加 */
#endif /* EMINJ_FREE1 */

/* 新構造体要求専用 */
#if EMINJ_FREE2 == ON       /*【ﾌﾘｰﾎﾟｰﾄ2使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート2使用時にインクルード追加 */
#endif /* EMINJ_FREE2 */

#if EMINJ_FREE3 == ON       /*【ﾌﾘｰﾎﾟｰﾄ3使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート3使用時にインクルード追加 */
#endif /* EMINJ_FREE3 */

#if EMINJ_FREE4 == ON       /*【ﾌﾘｰﾎﾟｰﾄ4使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート4使用時にインクルード追加 */
#endif /* EMINJ_FREE4 */

#if EMINJ_FREE5 == ON       /*【ﾌﾘｰﾎﾟｰﾄ5使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート5使用時にインクルード追加 */
#endif /* EMINJ_FREE5 */

#if EMINJ_FREE6 == ON       /*【ﾌﾘｰﾎﾟｰﾄ6使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート6使用時にインクルード追加 */
#endif /* EMINJ_FREE6 */

#if EMINJ_FREE7 == ON       /*【ﾌﾘｰﾎﾟｰﾄ7使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート7使用時にインクルード追加 */
#endif /* EMINJ_FREE7 */

#if EMINJ_FREE8 == ON       /*【ﾌﾘｰﾎﾟｰﾄ8使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート8使用時にインクルード追加 */
#endif /* EMINJ_FREE8 */

#if EMINJ_FREE9 == ON       /*【ﾌﾘｰﾎﾟｰﾄ9使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート9使用時にインクルード追加 */
#endif /* EMINJ_FREE9 */

#if EMINJ_FREE10 == ON      /*【ﾌﾘｰﾎﾟｰﾄ10使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート10使用時にインクルード追加 */
#endif /* EMINJ_FREE10 */

#if EMINJ_FREE11 == ON      /*【ﾌﾘｰﾎﾟｰﾄ11使用】*/
/* #include <xxxxx/xxxxx.h> フリーポート11使用時にインクルード追加 */
#endif /* EMINJ_FREE11 */

/*-------------------------------------------------------------------*/
/* マクロ定義                                                        */
/*-------------------------------------------------------------------*/
/**********************************************/
/* フリーポート０の設定                       */
/**********************************************/
#if EMINJ_FREE0 == ON       /*【ﾌﾘｰﾎﾟｰﾄ0使用】*/
/* #define vdg_eminj_efree0_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート0のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE0_PRI)               フリーポート0用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE0_ID)                フリーポート0用制御のID */
#endif /* EMINJ_FREE0 */

/**********************************************/
/* フリーポート１の設定                       */
/**********************************************/
#if EMINJ_FREE1 == ON       /*【ﾌﾘｰﾎﾟｰﾄ1使用】*/
/* #define vdg_eminj_efree1_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート1のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE1_PRI)               フリーポート1用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE1_ID)                フリーポート1用制御のID */
#endif /* EMINJ_FREE1 */

/* 新構造体要求専用 */
/**********************************************/
/* フリーポート２の設定                       */
/**********************************************/
#if EMINJ_FREE2 == ON       /*【ﾌﾘｰﾎﾟｰﾄ2使用】*/
/* #define vdg_eminj_efree2_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート2のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE2_PRI)               フリーポート2用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE2_ID)                フリーポート2用制御のID */
#endif /* EMINJ_FREE2 */

/**********************************************/
/* フリーポート３の設定                       */
/**********************************************/
#if EMINJ_FREE3 == ON       /*【ﾌﾘｰﾎﾟｰﾄ3使用】*/
/* #define vdg_eminj_efree3_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート3のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE3_PRI)               フリーポート3用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE3_ID)                フリーポート3用制御のID */
#endif /* EMINJ_FREE3 */

/**********************************************/
/* フリーポート４の設定                       */
/**********************************************/
#if EMINJ_FREE4 == ON       /*【ﾌﾘｰﾎﾟｰﾄ4使用】*/
/* #define vdg_eminj_efree4_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート4のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE4_PRI)               フリーポート4用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE4_ID)                フリーポート4用制御のID */
#endif /* EMINJ_FREE4 */

/**********************************************/
/* フリーポート５の設定                       */
/**********************************************/
#if EMINJ_FREE5 == ON       /*【ﾌﾘｰﾎﾟｰﾄ5使用】*/
/* #define vdg_eminj_efree5_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート5のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE5_PRI)               フリーポート5用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE5_ID)                フリーポート5用制御のID */
#endif /* EMINJ_FREE5 */

/**********************************************/
/* フリーポート６の設定                       */
/**********************************************/
#if EMINJ_FREE6 == ON       /*【ﾌﾘｰﾎﾟｰﾄ6使用】*/
/* #define vdg_eminj_efree6_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート6のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE6_PRI)               フリーポート6用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE6_ID)                フリーポート6用制御のID */
#endif /* EMINJ_FREE6 */

/**********************************************/
/* フリーポート７の設定                       */
/**********************************************/
#if EMINJ_FREE7 == ON       /*【ﾌﾘｰﾎﾟｰﾄ7使用】*/
/* #define vdg_eminj_efree7_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート7のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE7_PRI)               フリーポート7用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE7_ID)                フリーポート7用制御のID */
#endif /* EMINJ_FREE7 */

/**********************************************/
/* フリーポート８の設定                       */
/**********************************************/
#if EMINJ_FREE8 == ON       /*【ﾌﾘｰﾎﾟｰﾄ8使用】*/
/* #define vdg_eminj_efree8_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート8のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE8_PRI)               フリーポート8用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE8_ID)                フリーポート8用制御のID */
#endif /* EMINJ_FREE8 */

/**********************************************/
/* フリーポート９の設定                       */
/**********************************************/
#if EMINJ_FREE9 == ON       /*【ﾌﾘｰﾎﾟｰﾄ9使用】*/
/* #define vdg_eminj_efree9_emedi_dataget   (vdg_eminj_XXXXX_emedi_dataget)     フリーポート9のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE9_PRI)               フリーポート9用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE9_ID)                フリーポート9用制御のID */
#endif /* EMINJ_FREE9 */

/**********************************************/
/* フリーポート１０の設定                     */
/**********************************************/
#if EMINJ_FREE10 == ON      /*【ﾌﾘｰﾎﾟｰﾄ10使用】*/
/* #define vdg_eminj_efree10_emedi_dataget  (vdg_eminj_XXXXX_emedi_dataget)     フリーポート10のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE10_PRI)              フリーポート10用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE10_ID)               フリーポート10用制御のID */
#endif /* EMINJ_FREE10 */

/**********************************************/
/* フリーポート１１の設定                     */
/**********************************************/
#if EMINJ_FREE11 == ON      /*【ﾌﾘｰﾎﾟｰﾄ11使用】*/
/* #define vdg_eminj_efree11_emedi_dataget  (vdg_eminj_XXXXX_emedi_dataget)     フリーポート11のデータ取得関数 */
/* #define u1g_eminj_XXXXX_PRI              (u1g_eminj_FREE11_PRI)              フリーポート11用制御の優先度 */
/* #define u1g_EMINJ_XXXXX_ID               (u1g_EMINJ_FREE11_ID)               フリーポート11用制御のID */
#endif /* EMINJ_FREE11 */

#endif /* EMINJ_EDIT_H */

/**** End of File ****************************************************/
